project3_products/app/Controllers/ProductController.php

    public function index()
    {
        $data['products'] = $this->productModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `products`
ORDER BY `id` DESC