project2_employees/app/Controllers/EmployeeController.php

SELECT *
FROM `employees`
ORDER BY `id` DESC
---
    public function index()
    {
        $data['employees'] = $this->employeeModel->orderBy('id', 'DESC')->findAll();

INSERT INTO `employees` (`first_name`, `last_name`, `email`, `phone`, `department`, `position`, `salary`, `hire_date`, `address`, `status`, `created_at`, `updated_at`) VALUES ('asfasfas', 'asf', 'miguel31213@gmail.com', '09123456789', 'IT', 'Sixty Nine', '12300', '2025-11-30', 'sfasfasgas', 'active', '2025-12-14 06:16:22', '2025-12-14 06:16:22')
---
    public function store()
    {
        $rules = [
            'first_name' => 'required|min_length[2]|max_length[50]',
            'last_name' => 'required|min_length[2]|max_length[50]',
            'email' => 'required|valid_email',
            'phone' => 'required|min_length[10]',
            'department' => 'required',
            'position' => 'required',
            'salary' => 'required|numeric',
            'hire_date' => 'required|valid_date'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->employeeModel->save([
            'first_name' => $this->request->getPost('first_name'),
            'last_name' => $this->request->getPost('last_name'),
            'email' => $this->request->getPost('email'),
            'phone' => $this->request->getPost('phone'),
            'department' => $this->request->getPost('department'),
            'position' => $this->request->getPost('position'),
            'salary' => $this->request->getPost('salary'),
            'hire_date' => $this->request->getPost('hire_date'),
            'address' => $this->request->getPost('address'),
            'status' => $this->request->getPost('status') ?? 'active'
        ]);