project2_employees/app/Controllers/Api/EmployeeApiController.php

SELECT *
FROM `employees`
ORDER BY `id` DESC
---
    public function index()
    {
        $employees = $this->employeeModel->orderBy('id', 'DESC')->findAll();