project1_books/app/Controllers/BookController.php

SELECT *
FROM `books`
ORDER BY `id` DESC
---
    public function index()
    {
        $data['books'] = $this->bookModel->orderBy('id', 'DESC')->findAll();

INSERT INTO `books` (`title`, `author`, `isbn`, `published_year`, `genre`, `price`, `description`, `created_at`, `updated_at`) VALUES ('itot', 'sfadgsdhfj', '2435678908765342', '1800', 'Non-Fiction', '12', 'afdgdhjhgfdss', '2025-12-14 06:03:29', '2025-12-14 06:03:29')
---
    public function store()
    {
        $validation = \Config\Services::validation();

        $rules = [
            'title' => 'required|min_length[3]|max_length[200]',
            'author' => 'required|min_length[2]|max_length[100]',
            'isbn' => 'required|min_length[10]|max_length[20]',
            'published_year' => 'required|numeric|min_length[4]|max_length[4]',
            'genre' => 'required',
            'price' => 'required|decimal'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        $this->bookModel->save([
            'title' => $this->request->getPost('title'),
            'author' => $this->request->getPost('author'),
            'isbn' => $this->request->getPost('isbn'),
            'published_year' => $this->request->getPost('published_year'),
            'genre' => $this->request->getPost('genre'),
            'price' => $this->request->getPost('price'),
            'description' => $this->request->getPost('description')
        ]);